#include<iostream>
using namespace std;


int main567()
{
	//加减乘除
	//小数不能进行取余运算（取模运算），因此不能用double类型数据进行运算
	//前置递增a++,是先加对变量加1，再进行表达式运算；后置递增++a,是先进行表达式运算，再对变量+1
	//赋值运算：先进行表达式运算，再赋值给变量，事例见下方
	//比较运算：比较表达式(有==（等于），！=（不等于），>=(大于等于），<=(小于等于），>,<等等，并返回bool类型的值，只有可能返回1或0（即true或false)
	//逻辑运算：与（&&，二者都成立才真），或（||，二者都不成立才假），非（！）等等，返回bool类型值，只有可能1或0（同上），注：计算机默认除了0都为真，如定义a=10,则a为真，！a则为假，！！a则为真，
	int a = 10, b = 3, c = a++ * b, d = ++a * b;
	a += 2;//相当于a=a+2,其余运算同理
	cout << a + b << endl;//17（10+1+1+2+3）
	cout << a / b << endl;//4（（10+1+1+2）/3的整数部分）
	cout << a % b << endl;//2（（10+1+1+2）%3的余数部分）
	cout << a * b << endl;//42
	cout << c << endl; //30，相当于先进行乘法这一表达式的运算，运算结束得到变量c的值之后，再进行a的加1操作（这里c,d各进行++了1次所以加了两次1）
	cout << d << endl;//36，相当于先对a进行加1操作（同上述注释），再进行乘法运算得到d的值，（前置后置递减同理）
	cout << (a == b) << endl;//返回结果为0，因为a和b不相等，其余比较运算符同理，注意要对比较运算符加上括号来提高优先级防止报错
	cout << !a << endl;//返回0，本身为真，非后就变假
	cout << !!a << endl;//返回1，双重否定变肯定
	cout << (a &&b) << endl;//返回1，全真才真（本例子中变量不为0就真）
	cout << (a || b) << endl;//返回1，有一个真就真了（同理）




	system("pause");

	return 0;
}