#include<iostream>
using namespace std;

/*
1.定义指针：①语法：数据类型*指针变量名（如：int*p)  ②让指针变量指向某个变量的地址：指针变量名=&变量名（如：p=&a)
2.使用指针：①可以通过解引用（指针前加*）的方式来找到指针指向的内存中的数据（如：*p)  ②同时也可以通过指针修改或者读取内存中的数据（如：*p=100,a=*p)
3.指针所占内存空间：无论何种数据类型（int，double，char，float等），32位系统（*86）指针所占内存空间都为4,64位（*64）都为8
4.空指针NULL：用于对指针变量进行初始化，指针变量指向内存中编号为0的空间，空指针指向的内存是不可以访问的（内存编号0-255为系统占用内存，不允许用户访问）
5.野指针：指针变量指向非法的内存空间，导致崩溃！！！
注：空和野指针都不是我们申请的空间，因此不要访问！！！
6.const修饰指针：①常量指针：const 数据类型*指针变量名（如：const int*p=&a)，其中const修饰的是指针，指针指向可以改，指向的值不可以改
                 ②指针常量：数据类型*const 指针变量名（如：int*const p=&a),其中const修饰的是常量，指针指向不可以改，指向的值可以改
				 ③const同时修饰指针和常量：const 数据类型*const指针变量名（如：const int*const p=&a),指针指向和指向的值都不可以改
注：const若在*前面则是修饰指针（*p),则*p所表示的值（如100）不可以改成10；const若在*后面则是修饰常量（p),则p所表示的指向（如&a)不可以改成&b
7.指针和数组：利用指针访问数组中的元素，可通过指针变量指向数组首地址，再利用for循环遍历数组中的每个元素
8.指针和函数：指针作为函数参数，可以改变实参的值！！！这是一个地址传递，不同于前面的值传递（swap）（值传递不会改变实参的值！！！
 


*/

//指针和函数
void swap(int* r, int* s)
{
	int temp = *r;
	*r = *s;
	*s = temp;
}





int main12345()
{
	//定义指针
	int a = 100;
	int b = 20;
	int* p;
	p = &a;//让指针变量指向变量a的地址，19,20行可以合并成int*p=&a
	cout << "p=" << (int)p << endl;
	cout << "&a=" << (int)&a << endl;
	//使用指针
	*p = 100;
	cout << "a=" << a << endl;
	cout << "*p=" <<*p<< endl;

	//指针所占内存空间
	cout << "指针所占内存空间为：" << sizeof (int*)<< endl;

	//空指针
	//int* q = NULL;
	//若输入*q = 100，由于空指针不可以访问内存中的数据，会报错！！！
	//cout << "q=" <<(int) q << endl;//输出0，即空指针指向的内存地址编号为0

	//野指针
	//int* r = (int*)0x1100;//指针变量指向0x1100这个非法内存空间，会崩溃！！！
	//cout << "r=" << r << endl;

	//const修饰指针见上方注释

	//指针和数组
	int arr[5] = { 1,2,3,4,5 };
	int* p1 = arr;//此时指针变量指向数组首地址
	cout << p1 << endl;
	cout << "利用指针遍历访问数组中每个元素：" << endl;
	for (int i = 0; i <= 4; i++)
	{
		cout << *p1 << endl;
		p1++;
	}
	swap(&a,& b);
	cout << "a=" << a << endl;
	cout << "b=" << b << endl;//此时a,b这两个实参值也会被交换位置（而不像值传递中实参不变！！！）



    
	return 0;
}